<?php

do {
    $question = (int)readline(
        "В каком году произошло крещение Руси? 
        - 810 
        - 988 
        - 740 \n");

} while ($question != 810 && $question != 988 && $question != 740);

if($question === 988){
    echo "Поздравляю! Ответ правильный!";
} else {
    echo"Ответ неправильный";
}

//===========================================================================

// do {
//     $question = (int)readline(
//         "В каком году произошло крещение Руси? 
//         - 810 
//         - 988 
//         - 740 \n");

//         if($question === 988){
//             echo "Поздравляю! Ответ правильный!";
//             break;
//         } 
//         if ($question == 810 || $question == 740) {
//             echo"Ответ неправильный";
//             break;
//         }
// } while (true);

//===========================================================================

// do {
//     $question = (int)readline(
//         "В каком году произошло крещение Руси?
//         - 810
//         - 740
//         - 988 \n");
        
//         switch ($question) {
//             case 810:
//             case 740:
//                 echo "Ответ неправильный \n";
//                 break(2);
//             case $question == 988:
//                 echo "Поздравляю! Ответ правильный! \n"; 
//                 break(2); 
//         }
// } while (true);

//===========================================================================

// while (true) {
//     $question = (int)readline(
//         "В каком году произошло крещение Руси?
//         - 810
//         - 740
//         - 988 \n");

//     if ($question == 810 || $question == 740) {
//         echo "Ответ неправильный";
//         break;
//     } elseif ($question == 988) {
//         echo "Поздравляю! Ответ правильный!";
//         break; 
//     }
// }

//===========================================================================










